{"metas":[{"id":"tt0093773","type":"movie","name":"Predator","poster":"https://image.tmdb.org/t/p/w500/k3mW4qfJo6SKqe6laRyNGnbB9n5.jpg","description":"A team of elite commandos on a secret mission in a Central American jungle come to find themselves hunted by an extraterrestrial warrior."},{"id":"tt0088247","type":"movie","name":"The Terminator","poster":"https://image.tmdb.org/t/p/w500/hzXSE66v6KthZ8nPoLZmsi2G05j.jpg","description":"In the post-apocalyptic future, reigning tyrannical supercomputers teleport a cyborg assassin known as the \"Terminator\" back to 1984 to kill Sarah Connor, whose unborn son is destined to lead insurgents against 21st century mechanical hegemony. Meanwhile, the human-resistance movement dispatches a lone warrior to safeguard Sarah. Can he stop the virtually indestructible killing machine?"},{"id":"tt0086250","type":"movie","name":"Scarface","poster":"https://image.tmdb.org/t/p/w500/iQ5ztdjvteGeboxtmRdXEChJOHh.jpg","description":"After getting a green card in exchange for assassinating a Cuban government official, Tony Montana stakes a claim on the drug trade in Miami. Viciously murdering anyone who stands in his way, Tony eventually becomes the biggest drug lord in the state, controlling nearly all the cocaine that comes through Miami. But increased pressure from the police, wars with Colombian drug cartels and his own drug-fueled paranoia serve to fuel the flames of his eventual downfall."},{"id":"tt0095016","type":"movie","name":"Die Hard","poster":"https://image.tmdb.org/t/p/w500/aJCpHDC6RoGz7d1Fzayl019xnxX.jpg","description":"NYPD cop John McClane's plan to reconcile with his estranged wife is thrown for a serious loop when, minutes after he arrives at her offices Christmas Party, the entire building is overtaken by a group of terrorists. With little help from the LAPD, wisecracking McClane sets out to single-handedly rescue the hostages and bring the bad guys down."},{"id":"tt0091763","type":"movie","name":"Platoon","poster":"https://image.tmdb.org/t/p/w500/m3mmFkPQKvPZq5exmh0bDuXlD9T.jpg","description":"As a young and naive recruit in Vietnam, Chris Taylor faces a moral crisis when confronted with the horrors of war and the duality of man."},{"id":"tt0082198","type":"movie","name":"Conan the Barbarian","poster":"https://image.tmdb.org/t/p/w500/qw2A587Ee61IwcSOLNFRhuOACZZ.jpg","description":"A horde of rampaging warriors massacre the parents of young Conan and enslave the young child for years on The Wheel of Pain. As the sole survivor of the childhood massacre, Conan is released from slavery and taught the ancient arts of fighting. Transforming himself into a killing machine, Conan travels into the wilderness to seek vengeance on Thulsa Doom, the man responsible for killing his family. In the wilderness, Conan takes up with the thieves Valeria and Subotai. The group comes upon King Osric, who wants the trio of warriors to help rescue his daughter who has joined Doom in the hills."},{"id":"tt0082971","type":"movie","name":"Raiders of the Lost Ark","poster":"https://image.tmdb.org/t/p/w500/ceG9VzoRAVGwivFU403Wc3AHRys.jpg","description":"When Dr. Indiana Jones – the tweed-suited professor who just happens to be a celebrated archaeologist – is hired by the government to locate the legendary Ark of the Covenant, he finds himself up against the entire Nazi regime."},{"id":"tt0090605","type":"movie","name":"Aliens","poster":"https://image.tmdb.org/t/p/w500/r1x5JGpyqZU8PYhbs4UcrO1Xb6x.jpg","description":"Ripley, the sole survivor of the Nostromo's deadly encounter with the monstrous Alien, returns to Earth after drifting through space in hypersleep for 57 years. Although her story is initially met with skepticism, she agrees to accompany a team of Colonial Marines back to LV-426."},{"id":"tt0094625","type":"movie","name":"Akira","poster":"https://image.tmdb.org/t/p/w500/neZ0ykEsPqxamsX6o5QNUFILQrz.jpg","description":"A secret military project endangers Neo-Tokyo when it turns a biker gang member into a rampaging psychic psychopath that only two teenagers and a group of psychics can stop."},{"id":"tt0092099","type":"movie","name":"Top Gun","poster":"https://image.tmdb.org/t/p/w500/xUuHj3CgmZQ9P2cMaqQs4J0d4Zc.jpg","description":"For Lieutenant Pete 'Maverick' Mitchell and his friend and co-pilot Nick 'Goose' Bradshaw, being accepted into an elite training school for fighter pilots is a dream come true. But a tragedy, as well as personal demons, will threaten Pete's dreams of becoming an ace pilot."},{"id":"tt0095631","type":"movie","name":"Midnight Run","poster":"https://image.tmdb.org/t/p/w500/yx0touyDQ9enWDsFgS4MbBwCSNd.jpg","description":"A bounty hunter pursues a former Mafia accountant who is also being chased by a rival bounty hunter, the F.B.I., and his old mob boss after jumping bail."},{"id":"tt0091203","type":"movie","name":"Highlander","poster":"https://image.tmdb.org/t/p/w500/8Z8dptJEypuLoOQro1WugD855YE.jpg","description":"He fought his first battle on the Scottish Highlands in 1536. He will fight his greatest battle on the streets of New York City in 1986. His name is Connor MacLeod. He is immortal."},{"id":"tt15671732","type":"movie","name":"Dengeki Sentai Changeman: The Movie","poster":"https://image.tmdb.org/t/p/w500/hGytehBpgg4ltsGDcPOwA7qN7vW.jpg","description":"The Changeman must work with an earthquake institute to prevent Earth from being destroyed in a sea of fire by the Gozma."},{"id":"tt0083944","type":"movie","name":"First Blood","poster":"https://image.tmdb.org/t/p/w500/a9sa6ERZCpplbPEO7OMWE763CLD.jpg","description":"When former Green Beret John Rambo is harassed by local law enforcement and arrested for vagrancy, he is forced to flee into the mountains and wage an escalating one-man war against his pursuers."},{"id":"tt0085127","type":"movie","name":"Project A","poster":"https://image.tmdb.org/t/p/w500/c6OVzxnnz5D3xkb6THHNrtP8s26.jpg","description":"In late 19th century Hong Kong, the British may rule the land, but the pirates rule the waters. Coast Guard officer Dragon Ma is determined that his beloved Coast Guard will not be made a fool of."},{"id":"tt0080801","type":"movie","name":"The Gods Must Be Crazy","poster":"https://image.tmdb.org/t/p/w500/IgBfj5LfT7nwpodCZ34QCHp17x.jpg","description":"A Coca-Cola bottle dropped from an airplane raises havoc among a normally peaceful tribe of African bushmen who believe it to be a utensil of the gods."},{"id":"tt0097576","type":"movie","name":"Indiana Jones and the Last Crusade","poster":"https://image.tmdb.org/t/p/w500/sizg1AU8f8JDZX4QIgE4pjUMBvx.jpg","description":"In 1938, an art collector appeals to eminent archaeologist Dr. Indiana Jones to embark on a search for the Holy Grail. Indy learns that a medieval historian has vanished while searching for it, and the missing man is his own father, Dr. Henry Jones Sr.. He sets out to rescue his father by following clues in the old man's notebook, which his father had mailed to him before he went missing. Indy arrives in Venice, where he enlists the help of a beautiful academic, Dr. Elsa Schneider, along with Marcus Brody and Sallah. Together they must stop the Nazis from recovering the power of eternal life and taking over the world!"},{"id":"tt0082398","type":"movie","name":"For Your Eyes Only","poster":"https://image.tmdb.org/t/p/w500/rIbhuS2xBHDYWAriFxLABlK2LZV.jpg","description":"A British spy ship has sunk and on board was a hi-tech encryption device. James Bond is sent to find the device that holds British launching instructions before the enemy Soviets get to it first."},{"id":"tt2325617","type":"movie","name":"Dai Sentai Goggle-V: The Movie","poster":"https://image.tmdb.org/t/p/w500/cb3WeEYv41Sak59r9gbYmZJBCcL.jpg","description":"Goggle V must prevent Deathdark from using their new laser weapon to destroy Tokyo. This movie takes place some time between episodes 8 and 14 of the Goggle V TV series."},{"id":"tt0096933","type":"movie","name":"Black Rain","poster":"https://image.tmdb.org/t/p/w500/funhGWt9ee3Uwb6Ar8SGCCvbJdV.jpg","description":"Two New York cops get involved in a gang war between members of the Yakuza, the Japanese Mafia. They arrest one of their killers and are ordered to escort him back to Japan. However, in Japan he manages to escape, and as they try to track him down, they get deeper and deeper into the Japanese Mafia scene and they have to learn that they can only win by playing the game—the Japanese way."}]}