{"metas":[{"id":"tt0080684","type":"movie","name":"The Empire Strikes Back","poster":"https://image.tmdb.org/t/p/w500/nNAeTmF4CtdSgMDplXTDPOpYzsX.jpg","description":"The epic saga continues as Luke Skywalker, in hopes of defeating the evil Galactic Empire, learns the ways of the Jedi from aging master Yoda. But Darth Vader is more determined than ever to capture Luke. Meanwhile, rebel leader Princess Leia, cocky Han Solo, Chewbacca, and droids C-3PO and R2-D2 are thrown into various stages of capture, betrayal and despair.","releaseInfo":"1980","imdbRating":"8.4"},{"id":"tt0086250","type":"movie","name":"Scarface","poster":"https://image.tmdb.org/t/p/w500/iQ5ztdjvteGeboxtmRdXEChJOHh.jpg","description":"After getting a green card in exchange for assassinating a Cuban government official, Tony Montana stakes a claim on the drug trade in Miami. Viciously murdering anyone who stands in his way, Tony eventually becomes the biggest drug lord in the state, controlling nearly all the cocaine that comes through Miami. But increased pressure from the police, wars with Colombian drug cartels and his own drug-fueled paranoia serve to fuel the flames of his eventual downfall.","releaseInfo":"1983","imdbRating":"8.2"},{"id":"tt0086190","type":"movie","name":"Return of the Jedi","poster":"https://image.tmdb.org/t/p/w500/jQYlydvHm3kUix1f8prMucrplhm.jpg","description":"Luke Skywalker leads a mission to rescue his friend Han Solo from the clutches of Jabba the Hutt, while the Emperor seeks to destroy the Rebellion once and for all with a second dreaded Death Star.","releaseInfo":"1983","imdbRating":"7.9"},{"id":"tt2372397","type":"movie","name":"Tatlong Baraha","poster":"https://image.tmdb.org/t/p/w500/mLtLIPGgKH5qgCEjXBFFBXv4F9V.jpg","description":"Came a time when these three men namely, Leon Guerrero, Julio Valiente and Geronimo was called by the Alkalde to fight his nemesis but in the end was  betrayed by the Alkalde, nevertheless, they were rewarded with the lovely daughters of the Alkalde to be their partners.","releaseInfo":"1981","imdbRating":"10.0"},{"id":"tt0082971","type":"movie","name":"Raiders of the Lost Ark","poster":"https://image.tmdb.org/t/p/w500/ceG9VzoRAVGwivFU403Wc3AHRys.jpg","description":"When Dr. Indiana Jones – the tweed-suited professor who just happens to be a celebrated archaeologist – is hired by the government to locate the legendary Ark of the Covenant, he finds himself up against the entire Nazi regime.","releaseInfo":"1981","imdbRating":"7.9"},{"id":"tt0090605","type":"movie","name":"Aliens","poster":"https://image.tmdb.org/t/p/w500/r1x5JGpyqZU8PYhbs4UcrO1Xb6x.jpg","description":"Ripley, the sole survivor of the Nostromo's deadly encounter with the monstrous Alien, returns to Earth after drifting through space in hypersleep for 57 years. Although her story is initially met with skepticism, she agrees to accompany a team of Colonial Marines back to LV-426.","releaseInfo":"1986","imdbRating":"8.0"},{"id":"tt0095016","type":"movie","name":"Die Hard","poster":"https://image.tmdb.org/t/p/w500/aJCpHDC6RoGz7d1Fzayl019xnxX.jpg","description":"NYPD cop John McClane's plan to reconcile with his estranged wife is thrown for a serious loop when, minutes after he arrives at her offices Christmas Party, the entire building is overtaken by a group of terrorists. With little help from the LAPD, wisecracking McClane sets out to single-handedly rescue the hostages and bring the bad guys down.","releaseInfo":"1988","imdbRating":"7.8"},{"id":"tt0097576","type":"movie","name":"Indiana Jones and the Last Crusade","poster":"https://image.tmdb.org/t/p/w500/sizg1AU8f8JDZX4QIgE4pjUMBvx.jpg","description":"In 1938, an art collector appeals to eminent archaeologist Dr. Indiana Jones to embark on a search for the Holy Grail. Indy learns that a medieval historian has vanished while searching for it, and the missing man is his own father, Dr. Henry Jones Sr.. He sets out to rescue his father by following clues in the old man's notebook, which his father had mailed to him before he went missing. Indy arrives in Venice, where he enlists the help of a beautiful academic, Dr. Elsa Schneider, along with Marcus Brody and Sallah. Together they must stop the Nazis from recovering the power of eternal life and taking over the world!","releaseInfo":"1989","imdbRating":"7.8"},{"id":"tt0092067","type":"movie","name":"Castle in the Sky","poster":"https://image.tmdb.org/t/p/w500/41XxSsJc5OrulP0m7TrrUeO2hoz.jpg","description":"A young boy and a girl with a magic crystal must race against pirates and foreign agents in a search for a legendary floating castle.","releaseInfo":"1986","imdbRating":"8.0"},{"id":"tt0088247","type":"movie","name":"The Terminator","poster":"https://image.tmdb.org/t/p/w500/hzXSE66v6KthZ8nPoLZmsi2G05j.jpg","description":"In the post-apocalyptic future, reigning tyrannical supercomputers teleport a cyborg assassin known as the \"Terminator\" back to 1984 to kill Sarah Connor, whose unborn son is destined to lead insurgents against 21st century mechanical hegemony. Meanwhile, the human-resistance movement dispatches a lone warrior to safeguard Sarah. Can he stop the virtually indestructible killing machine?","releaseInfo":"1984","imdbRating":"7.7"},{"id":"tt0094625","type":"movie","name":"Akira","poster":"https://image.tmdb.org/t/p/w500/neZ0ykEsPqxamsX6o5QNUFILQrz.jpg","description":"A secret military project endangers Neo-Tokyo when it turns a biker gang member into a rampaging psychic psychopath that only two teenagers and a group of psychics can stop.","releaseInfo":"1988","imdbRating":"7.9"},{"id":"tt0091763","type":"movie","name":"Platoon","poster":"https://image.tmdb.org/t/p/w500/m3mmFkPQKvPZq5exmh0bDuXlD9T.jpg","description":"As a young and naive recruit in Vietnam, Chris Taylor faces a moral crisis when confronted with the horrors of war and the duality of man.","releaseInfo":"1986","imdbRating":"7.7"},{"id":"tt0093773","type":"movie","name":"Predator","poster":"https://image.tmdb.org/t/p/w500/k3mW4qfJo6SKqe6laRyNGnbB9n5.jpg","description":"A team of elite commandos on a secret mission in a Central American jungle come to find themselves hunted by an extraterrestrial warrior.","releaseInfo":"1987","imdbRating":"7.5"},{"id":"tt0083944","type":"movie","name":"First Blood","poster":"https://image.tmdb.org/t/p/w500/a9sa6ERZCpplbPEO7OMWE763CLD.jpg","description":"When former Green Beret John Rambo is harassed by local law enforcement and arrested for vagrancy, he is forced to flee into the mountains and wage an escalating one-man war against his pursuers.","releaseInfo":"1982","imdbRating":"7.5"},{"id":"tt0087469","type":"movie","name":"Indiana Jones and the Temple of Doom","poster":"https://image.tmdb.org/t/p/w500/gpdVNUaa4LhRMLfJOPj1AZdhAZ3.jpg","description":"After arriving in India, Indiana Jones is asked by a desperate village to find a mystical stone. He agrees – and stumbles upon a secret cult plotting a terrible plan in the catacombs of an ancient palace.","releaseInfo":"1984","imdbRating":"7.3"},{"id":"tt0096895","type":"movie","name":"Batman","poster":"https://image.tmdb.org/t/p/w500/cij4dd21v2Rk2YtUQbV5kW69WB2.jpg","description":"Having witnessed his parents' brutal murder as a child, millionaire philanthropist Bruce Wayne fights crime in Gotham City disguised as Batman, a costumed hero who strikes fear into the hearts of villains. But when a deformed madman known as 'The Joker' seizes control of Gotham's criminal underworld, Batman must face his most ruthless nemesis ever while protecting both his identity and his love interest, reporter Vicki Vale.","releaseInfo":"1989","imdbRating":"7.2"},{"id":"tt0092099","type":"movie","name":"Top Gun","poster":"https://image.tmdb.org/t/p/w500/xUuHj3CgmZQ9P2cMaqQs4J0d4Zc.jpg","description":"For Lieutenant Pete 'Maverick' Mitchell and his friend and co-pilot Nick 'Goose' Bradshaw, being accepted into an elite training school for fighter pilots is a dream come true. But a tragedy, as well as personal demons, will threaten Pete's dreams of becoming an ace pilot.","releaseInfo":"1986","imdbRating":"7.1"},{"id":"tt0080801","type":"movie","name":"The Gods Must Be Crazy","poster":"https://image.tmdb.org/t/p/w500/IgBfj5LfT7nwpodCZ34QCHp17x.jpg","description":"A Coca-Cola bottle dropped from an airplane raises havoc among a normally peaceful tribe of African bushmen who believe it to be a utensil of the gods.","releaseInfo":"1980","imdbRating":"7.3"},{"id":"tt0097733","type":"movie","name":"Lethal Weapon 2","poster":"https://image.tmdb.org/t/p/w500/ZsUGxTnZ4TzTrHSAfUPJcliL1K.jpg","description":"Riggs and Murtaugh are on the trail of South African diplomats using their immunity to engage in criminal activities.","releaseInfo":"1989","imdbRating":"7.0"},{"id":"tt0095631","type":"movie","name":"Midnight Run","poster":"https://image.tmdb.org/t/p/w500/yx0touyDQ9enWDsFgS4MbBwCSNd.jpg","description":"A bounty hunter pursues a former Mafia accountant who is also being chased by a rival bounty hunter, the F.B.I., and his old mob boss after jumping bail.","releaseInfo":"1988","imdbRating":"7.2"}]}