{"metas":[{"id":"tt6323306","type":"movie","name":"Nude","poster":"https://image.tmdb.org/t/p/w500/699DbQ8eTecLmzjTLrao9D5bbpq.jpg","description":"NUDE explores perceptions of nudity in art by chronicling the creative process of photographer David Bellemere as he's commissioned by NU Muses founder Steve Shaw to shoot a fine art calendar of nude photographs.","releaseInfo":"2017","imdbRating":"9.4"},{"id":"tt23648788","type":"movie","name":"Counterattack","poster":"https://image.tmdb.org/t/p/w500/38I76hGcFY6xB47pjm7pZwkfuAF.jpg","description":"When a hostage rescue mission creates a new enemy, Capt. Guerrero and his elite soldiers must face an ambush by a criminal group.","releaseInfo":"2025","imdbRating":"8.3"},{"id":"tt15245268","type":"movie","name":"Young Hearts","poster":"https://image.tmdb.org/t/p/w500/iGCtYxfuvXfy0BD5m6p7vKuPOxS.jpg","description":"14-year-old Elias increasingly feels like an outsider in his village. When he meets his new neighbour of the same age, Alexander, Elias is confronted with his burgeoning sexuality.","releaseInfo":"2024","imdbRating":"8.5"},{"id":"tt26446278","type":"movie","name":"The Count of Monte Cristo","poster":"https://image.tmdb.org/t/p/w500/sAT1P3FGhtJ68anUyJScnMu8t1l.jpg","description":"Edmond Dantès becomes the target of a sinister plot and is arrested on his wedding day for a crime he did not commit. After 14 years in the island prison of Château d’If, he manages a daring escape. Now rich beyond his dreams, he assumes the identity of the Count of Monte-Cristo and exacts his revenge on the three men who betrayed him.","releaseInfo":"2024","imdbRating":"8.0"},{"id":"tt36463894","type":"movie","name":"Predator: Killer of Killers","poster":"https://image.tmdb.org/t/p/w500/2XDQa6EmFHSA37j1t0w88vpWqj9.jpg","description":"While three of the fiercest warriors in human history—a Viking raider, a ninja in feudal Japan, and a WWII pilot—are killers in their own right, they are merely prey for their new opponent: the ultimate killer of killers.","releaseInfo":"2025","imdbRating":"7.9"},{"id":"tt32550101","type":"movie","name":"STRAW","poster":"https://image.tmdb.org/t/p/w500/t3cmnXYtxJb9vVL1ThvT2CWSe1n.jpg","description":"What will be her last straw? A devastatingly bad day pushes a hardworking single mother to the breaking point — and into a shocking act of desperation.","releaseInfo":"2025","imdbRating":"7.8"},{"id":"tt15340724","type":"movie","name":"20th Century Girl","poster":"https://image.tmdb.org/t/p/w500/od22ftNnyag0TTxcnJhlsu3aLoU.jpg","description":"In 1999, a teen girl keeps close tabs on a boy in school on behalf of her deeply smitten best friend – then she gets swept up in a love story of her own.","releaseInfo":"2022","imdbRating":"8.2"},{"id":"tt30472557","type":"movie","name":"Chainsaw Man - The Movie: Reze Arc","poster":"https://image.tmdb.org/t/p/w500/xdzLBZjCVSEsic7m7nJc4jNJZVW.jpg","description":"In a brutal war between devils, hunters, and secret enemies, a mysterious girl named Reze has stepped into Denji's world, and he faces his deadliest battle yet, fueled by love in a world where survival knows no rules.","releaseInfo":"2025","imdbRating":"7.8"},{"id":"tt32549601","type":"movie","name":"Caramelo","poster":"https://image.tmdb.org/t/p/w500/c4ZEAah5a01cu27w7vT2IAoFogk.jpg","description":"After a life-changing diagnosis, a promising chef finds hope and humor with the help of a fur-midable dog friend.","releaseInfo":"2025","imdbRating":"7.8"},{"id":"tt10172266","type":"movie","name":"Red, White & Royal Blue","poster":"https://image.tmdb.org/t/p/w500/ta3ReqbdEcLJM3mcHMzbYFZI8v7.jpg","description":"After an altercation between Alex, the president's son, and Britain's Prince Henry at a royal event becomes tabloid fodder, their long-running feud now threatens to drive a wedge in U.S./British relations. When the rivals are forced into a staged truce, their icy relationship begins to thaw and the friction between them sparks something deeper than they ever expected.","releaseInfo":"2023","imdbRating":"7.9"},{"id":"tt21110654","type":"movie","name":"Aztec Batman: Clash of Empires","poster":"https://image.tmdb.org/t/p/w500/s0Mlo5w4INp3bUdsJo3RaSSMXWz.jpg","description":"In the time of the Aztec empire, tragedy strikes Yohualli Coatl when his father is murdered by Spanish conquistadors. To warn King Moctezuma and his high priest, Yoka, of imminent danger, Yohualli escapes to Tenochtitlán. There, he trains in the temple of the bat god Tzinacan with his mentor, developing equipment and weaponry to confront the Spanish invasion and avenge his father’s death. Along the way, he encounters key figures like the fierce Jaguar Woman and the conquistador Hernán Cortés.","releaseInfo":"2025","imdbRating":"7.8"},{"id":"tt14331144","type":"movie","name":"Jujutsu Kaisen 0","poster":"https://image.tmdb.org/t/p/w500/23oJaeBh0FDk2mQ2P240PU9Xxfh.jpg","description":"Yuta Okkotsu is a nervous high school student who is suffering from a serious problem—his childhood friend Rika has turned into a curse and won't leave him alone. Since Rika is no ordinary curse, his plight is noticed by Satoru Gojo, a teacher at Jujutsu High, a school where fledgling exorcists learn how to combat curses. Gojo convinces Yuta to enroll, but can he learn enough in time to confront the curse that haunts him?","releaseInfo":"2021","imdbRating":"8.1"},{"id":"tt12300742","type":"movie","name":"Bugonia","poster":"https://image.tmdb.org/t/p/w500/oxgsAQDAAxA92mFGYCZllgWkH9J.jpg","description":"Two conspiracy obsessed young men kidnap the high-powered CEO of a major company, convinced that she is an alien intent on destroying planet Earth.","releaseInfo":"2025","imdbRating":"7.7"},{"id":"tt7787524","type":"movie","name":"Henry Danger: The Movie","poster":"https://image.tmdb.org/t/p/w500/dFWj2rOGsqSIX1PHFghbCBgpMnk.jpg","description":"Henry Hart meets a superfan—eager to fight crime with Kid Danger—who comes into possession of a device that can open up alternate realities. Facing a wild ride, Henry will need his best friend Jasper and his new superfan sidekick to find his way out or be stuck in another dimension forever.","releaseInfo":"2025","imdbRating":"7.7"},{"id":"tt5198068","type":"movie","name":"Wolfwalkers","poster":"https://image.tmdb.org/t/p/w500/vqGiNbdc2sDwsnivMMYzwAoSSu6.jpg","description":"In a time of superstition and magic, when wolves are seen as demonic and nature an evil to be tamed, a young apprentice hunter comes to Ireland with her father to wipe out the last pack. But when she saves a wild native girl, their friendship leads her to discover the world of the Wolfwalkers and transform her into the very thing her father is tasked to destroy.","releaseInfo":"2020","imdbRating":"8.2"},{"id":"tt10954718","type":"movie","name":"Dog Man","poster":"https://image.tmdb.org/t/p/w500/89wNiexZdvLQ41OQWIsQy4O6jAQ.jpg","description":"When a faithful police dog and his human police officer owner are injured together on the job, a harebrained but life-saving surgery fuses the two of them together and Dog Man is born. Dog Man is sworn to protect and serve—and fetch, sit and roll over. As Dog Man embraces his new identity and strives to impress his Chief, he must stop the pretty evil plots of feline supervillain Petey the Cat.","releaseInfo":"2025","imdbRating":"7.6"},{"id":"tt15352542","type":"movie","name":"The Day the Earth Blew Up: A Looney Tunes Movie","poster":"https://image.tmdb.org/t/p/w500/s2lB1kaYCdGSnZX5meQCiOR6HfX.jpg","description":"Porky and Daffy, the classic animated odd couple, turn into unlikely heroes when their antics at the local bubble gum factory uncover a secret alien mind control plot. Against all odds, the two are determined to save their town (and the world!)...that is if they don't drive each other crazy in the process.","releaseInfo":"2024","imdbRating":"7.7"},{"id":"tt33311244","type":"movie","name":"Our Fault","poster":"https://image.tmdb.org/t/p/w500/yzqHt4m1SeY9FbPrfZ0C2Hi9x1s.jpg","description":"Jenna and Lion's wedding brings about the long-awaited reunion between Noah and Nick after their breakup. Nick's inability to forgive Noah stands as an insurmountable barrier. He, heir to his grandfather's businesses, and she, starting her professional life, resist fueling a flame that's still alive. But now that their paths have crossed again, will love be stronger than resentment?","releaseInfo":"2025","imdbRating":"7.5"},{"id":"tt11365186","type":"movie","name":"Redeeming Love","poster":"https://image.tmdb.org/t/p/w500/pDc2HxQtC0MlKD4QfRvmKREEyhc.jpg","description":"A retelling of the biblical book of Hosea set against the backdrop of the California Gold Rush of 1850.","releaseInfo":"2022","imdbRating":"7.8"},{"id":"tt10720352","type":"movie","name":"Arthur the King","poster":"https://image.tmdb.org/t/p/w500/zkKB3kOun5DKAkm61pHvLbrjxfa.jpg","description":"Over the course of ten days and 435 miles, an unbreakable bond is forged between pro adventure racer Michael Light and a scrappy street dog companion dubbed Arthur. As the team is pushed to their outer limits of endurance in the race, Arthur redefines what victory, loyalty and friendship truly mean.","releaseInfo":"2024","imdbRating":"7.6"}]}