{"metas":[{"id":"tt31193180","type":"movie","name":"Sinners","poster":"https://image.tmdb.org/t/p/w500/qTvFWCGeGXgBRaINLY1zqgTPSpn.jpg","description":"Trying to leave their troubled lives behind, twin brothers return to their hometown to start again, only to discover that an even greater evil is waiting to welcome them back.","releaseInfo":"2025","imdbRating":"7.5"},{"id":"tt17526714","type":"movie","name":"The Substance","poster":"https://image.tmdb.org/t/p/w500/evdF1vmLzuzH8EFblqAXBXWRGSi.jpg","description":"A fading celebrity decides to use a black market drug, a cell-replicating substance that temporarily creates a younger, better version of herself.","releaseInfo":"2024","imdbRating":"7.1"},{"id":"tt18412256","type":"movie","name":"Alien: Romulus","poster":"https://image.tmdb.org/t/p/w500/2uSWRTtCG336nuBiG8jOTEUKSy8.jpg","description":"While scavenging the deep ends of a derelict space station, a group of young space colonizers come face to face with the most terrifying life form in the universe.","releaseInfo":"2024","imdbRating":"7.2"},{"id":"tt4589218","type":"movie","name":"Five Nights at Freddy's","poster":"https://image.tmdb.org/t/p/w500/4dKRTUylqwXQ4VJz0BS84fqW2wa.jpg","description":"Recently fired and desperate for work, a troubled young man named Mike agrees to take a position as a night security guard at an abandoned theme restaurant: Freddy Fazbear's Pizzeria. But he soon discovers that nothing at Freddy's is what it seems.","releaseInfo":"2023","imdbRating":"7.4"},{"id":"tt7144666","type":"movie","name":"The Black Phone","poster":"https://image.tmdb.org/t/p/w500/p9ZUzCyy9wRTDuuQexkQ78R2BgF.jpg","description":"Finney Blake, a shy but clever 13-year-old boy, is abducted by a sadistic killer and trapped in a soundproof basement where screaming is of little use. When a disconnected phone on the wall begins to ring, Finney discovers that he can hear the voices of the killer’s previous victims. And they are dead set on making sure that what happened to them doesn’t happen to Finney.","releaseInfo":"2022","imdbRating":"7.5"},{"id":"tt32246771","type":"movie","name":"Bring Her Back","poster":"https://image.tmdb.org/t/p/w500/1Q3GlCXGYWELifxANYZ5OVMRVZl.jpg","description":"Following the death of their father, a brother and sister are sent to live with a foster mother, only to learn that she is hiding a terrifying secret.","releaseInfo":"2025","imdbRating":"7.4"},{"id":"tt26584495","type":"movie","name":"Companion","poster":"https://image.tmdb.org/t/p/w500/oCoTgC3UyWGfyQ9thE10ulWR7bn.jpg","description":"During a weekend getaway at a secluded lakeside estate, a group of friends finds themselves entangled in a web of secrets, deception, and advanced technology. As tensions rise and loyalties are tested, they uncover unsettling truths about themselves and the world around them.","releaseInfo":"2025","imdbRating":"7.0"},{"id":"tt9764362","type":"movie","name":"The Menu","poster":"https://image.tmdb.org/t/p/w500/fPtUgMcLIboqlTlPrq0bQpKK8eq.jpg","description":"A young couple travels to a remote island to eat at an exclusive restaurant where the chef has prepared a lavish menu, with some shocking surprises.","releaseInfo":"2022","imdbRating":"7.2"},{"id":"tt28015403","type":"movie","name":"Heretic","poster":"https://image.tmdb.org/t/p/w500/fr96XzlzsONrQrGfdLMiwtQjott.jpg","description":"Two young missionaries are forced to prove their faith when they knock on the wrong door and are greeted by a diabolical Mr. Reed, becoming ensnared in his deadly game of cat-and-mouse.","releaseInfo":"2024","imdbRating":"7.0"},{"id":"tt7069210","type":"movie","name":"The Conjuring: The Devil Made Me Do It","poster":"https://image.tmdb.org/t/p/w500/rQfX2xx8TUoNvyk892yKWNikJaM.jpg","description":"Paranormal investigators Ed and Lorraine Warren encounter what would become one of the most sensational cases from their files. The fight for the soul of a young boy takes them beyond anything they'd ever seen before, to mark the first time in U.S. history that a murder suspect would claim demonic possession as a defense.","releaseInfo":"2021","imdbRating":"7.4"},{"id":"tt5040012","type":"movie","name":"Nosferatu","poster":"https://image.tmdb.org/t/p/w500/5qGIxdEO841C0tdY8vOdLoRVrr0.jpg","description":"A gothic tale of obsession between a haunted young woman and the terrifying vampire infatuated with her, causing untold horror in its wake.","releaseInfo":"2024","imdbRating":"6.7"},{"id":"tt10548174","type":"movie","name":"28 Years Later","poster":"https://image.tmdb.org/t/p/w500/mIg1qCkVxnAlM2TK3RUF0tdEXlE.jpg","description":"Twenty-eight years since the rage virus escaped a biological weapons laboratory, now, still in a ruthlessly enforced quarantine, some have found ways to exist amidst the infected. One such group lives on a small island connected to the mainland by a single, heavily-defended causeway. When one member departs on a mission into the dark heart of the mainland, he discovers secrets, wonders, and horrors that have mutated not only the infected but other survivors as well.","releaseInfo":"2025","imdbRating":"6.7"},{"id":"tt8760708","type":"movie","name":"M3GAN","poster":"https://image.tmdb.org/t/p/w500/d9nBoowhjiiYc4FBNtQkPY7c11H.jpg","description":"A brilliant toy company roboticist uses artificial intelligence to develop M3GAN, a life-like doll programmed to emotionally bond with her newly orphaned niece. But when the doll's programming works too well, she becomes overprotective of her new friend with terrifying results.","releaseInfo":"2022","imdbRating":"7.0"},{"id":"tt31184028","type":"movie","name":"Together","poster":"https://image.tmdb.org/t/p/w500/m52XidzKx94bKlToZfEXUnL3pdy.jpg","description":"With a move to the countryside already testing the limits of a couple's relationship, a supernatural encounter begins an extreme transformation of their love, their lives, and their flesh.","releaseInfo":"2025","imdbRating":"7.1"},{"id":"tt27911000","type":"movie","name":"Terrifier 3","poster":"https://image.tmdb.org/t/p/w500/ju10W5gl3PPK3b7TjEmVOZap51I.jpg","description":"Five years after surviving Art the Clown's Halloween massacre, Sienna and Jonathan are still struggling to rebuild their shattered lives. As the holiday season approaches, they try to embrace the Christmas spirit and leave the horrors of the past behind. But just when they think they're safe, Art returns, determined to turn their holiday cheer into a new nightmare. The festive season quickly unravels as Art unleashes his twisted brand of terror, proving that no holiday is safe.","releaseInfo":"2024","imdbRating":"6.8"},{"id":"tt10374610","type":"movie","name":"The Long Walk","poster":"https://image.tmdb.org/t/p/w500/wobVTa99eW0ht6c1rNNzLkazPtR.jpg","description":"In a dystopian, alternate-America ruled by a totalitarian regime, 50 teenage boys take part in a deadly annual walking contest, forced to maintain a minimum pace or be executed, until only one survivor remains.","releaseInfo":"2025","imdbRating":"6.9"},{"id":"tt18925334","type":"movie","name":"Pearl","poster":"https://image.tmdb.org/t/p/w500/z5uIG81pXyHKg7cUFIu84Wjn4NS.jpg","description":"Trapped on her family’s isolated farm, Pearl must tend to her ailing father under the bitter and overbearing watch of her devout mother. Lusting for a glamorous life like she’s seen in the movies, Pearl’s ambitions, temptations, and repressions collide.","releaseInfo":"2022","imdbRating":"7.2"},{"id":"tt31434030","type":"movie","name":"Dracula","poster":"https://image.tmdb.org/t/p/w500/Ap4kyIiMGsCAI6IKrJejp6AAiTL.jpg","description":"When a 15th-century prince denounces God after the devastating loss of his wife, he inherits an eternal curse: he becomes Dracula. Condemned to wander the centuries, he defies fate and death itself, guided by a single hope — to be reunited with his lost love.","releaseInfo":"2025","imdbRating":"7.1"},{"id":"tt29644189","type":"movie","name":"Black Phone 2","poster":"https://image.tmdb.org/t/p/w500/gFddBLQ8wj9M9O82iPzgX5KVNHz.jpg","description":"Four years after escaping The Grabber, Finney Blake is struggling with his life after captivity. When his sister Gwen begins receiving calls in her dreams from the black phone and seeing disturbing visions of three boys being stalked at a winter camp, the siblings become determined to solve the mystery and confront a killer who has grown more powerful in death and more significant to them than either could imagine.","releaseInfo":"2025","imdbRating":"6.9"},{"id":"tt13560574","type":"movie","name":"X","poster":"https://image.tmdb.org/t/p/w500/lopZSVtXzhFY603E9OqF7O1YKsh.jpg","description":"In 1979, a group of young filmmakers set out to make an adult film in rural Texas, but when their reclusive, elderly hosts catch them in the act, the cast find themselves fighting for their lives.","releaseInfo":"2022","imdbRating":"6.7"}]}