{"metas":[{"id":"tt14205554","type":"movie","name":"KPop Demon Hunters","poster":"https://image.tmdb.org/t/p/w500/zT7Lhw3BhJbMkRqm9Zlx2YGMsY0.jpg","description":"When K-pop superstars Rumi, Mira and Zoey aren't selling out stadiums, they're using their secret powers to protect their fans from supernatural threats.","releaseInfo":"2025","imdbRating":"8.2"},{"id":"tt26743210","type":"movie","name":"How to Train Your Dragon","poster":"https://image.tmdb.org/t/p/w500/q5pXRYTycaeW6dEgsCrd4mYPmxM.jpg","description":"On the rugged isle of Berk, where Vikings and dragons have been bitter enemies for generations, Hiccup stands apart, defying centuries of tradition when he befriends Toothless, a feared Night Fury dragon. Their unlikely bond reveals the true nature of dragons, challenging the very foundations of Viking society.","releaseInfo":"2025","imdbRating":"8.0"},{"id":"tt16311594","type":"movie","name":"F1","poster":"https://image.tmdb.org/t/p/w500/vqBmyAj0Xm9LnS1xe1MSlMAJyHq.jpg","description":"Racing legend Sonny Hayes is coaxed out of retirement to lead a struggling Formula 1 team—and mentor a young hotshot driver—while chasing one more chance at glory.","releaseInfo":"2025","imdbRating":"7.8"},{"id":"tt5950044","type":"movie","name":"Superman","poster":"https://image.tmdb.org/t/p/w500/ldyfo0BKmz5rWtJJKCvwaNS4cJT.jpg","description":"Superman, a journalist in Metropolis, embarks on a journey to reconcile his Kryptonian heritage with his human upbringing as Clark Kent.","releaseInfo":"2025","imdbRating":"7.4"},{"id":"tt1312221","type":"movie","name":"Frankenstein","poster":"https://image.tmdb.org/t/p/w500/g4JtvGlQO7DByTI6frUobqvSL3R.jpg","description":"Dr. Victor Frankenstein, a brilliant but egotistical scientist, brings a creature to life in a monstrous experiment that ultimately leads to the undoing of both the creator and his tragic creation.","releaseInfo":"2025","imdbRating":"7.8"},{"id":"tt26581740","type":"movie","name":"Weapons","poster":"https://image.tmdb.org/t/p/w500/cpf7vsRZ0MYRQcnLWteD5jK9ymT.jpg","description":"When all but one child from the same class mysteriously vanish on the same night at exactly the same time, a community is left questioning who or what is behind their disappearance.","releaseInfo":"2025","imdbRating":"7.3"},{"id":"tt9603208","type":"movie","name":"Mission: Impossible - The Final Reckoning","poster":"https://image.tmdb.org/t/p/w500/z53D72EAOxGRqdr7KXXWp9dJiDe.jpg","description":"Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.","releaseInfo":"2025","imdbRating":"7.3"},{"id":"tt30144839","type":"movie","name":"One Battle After Another","poster":"https://image.tmdb.org/t/p/w500/m1jFoahEbeQXtx4zArT2FKdbNIj.jpg","description":"Washed-up revolutionary Bob exists in a state of stoned paranoia, surviving off-grid with his spirited, self-reliant daughter, Willa. When his evil nemesis resurfaces after 16 years and she goes missing, the former radical scrambles to find her, father and daughter both battling the consequences of his past.","releaseInfo":"2025","imdbRating":"7.5"},{"id":"tt7181546","type":"movie","name":"Ballerina","poster":"https://image.tmdb.org/t/p/w500/2VUmvqsHb6cEtdfscEA6fqqVzLg.jpg","description":"Taking place during the events of John Wick: Chapter 3 – Parabellum, Eve Macarro begins her training in the assassin traditions of the Ruska Roma.","releaseInfo":"2025","imdbRating":"7.3"},{"id":"tt6263850","type":"movie","name":"Deadpool & Wolverine","poster":"https://image.tmdb.org/t/p/w500/8cdWjvZQUExUUTzyp4t6EDMubfO.jpg","description":"A listless Wade Wilson toils away in civilian life with his days as the morally flexible mercenary, Deadpool, behind him. But when his homeworld faces an existential threat, Wade must reluctantly suit-up again with an even more reluctant Wolverine.","releaseInfo":"2024","imdbRating":"7.6"},{"id":"tt9619824","type":"movie","name":"Final Destination Bloodlines","poster":"https://image.tmdb.org/t/p/w500/6WxhEvFsauuACfv8HyoVX6mZKFj.jpg","description":"Plagued by a violent recurring nightmare, college student Stefanie heads home to track down the one person who might be able to break the cycle and save her family from the grisly demise that inevitably awaits them all.","releaseInfo":"2025","imdbRating":"7.1"},{"id":"tt10676052","type":"movie","name":"The Fantastic 4: First Steps","poster":"https://image.tmdb.org/t/p/w500/cm8TNGBGG0aBfWj0LgrESHv8tir.jpg","description":"Against the vibrant backdrop of a 1960s-inspired, retro-futuristic world, Marvel's First Family is forced to balance their roles as heroes with the strength of their family bond, while defending Earth from a ravenous space god called Galactus and his enigmatic Herald, Silver Surfer.","releaseInfo":"2025","imdbRating":"7.0"},{"id":"tt11655566","type":"movie","name":"Lilo & Stitch","poster":"https://image.tmdb.org/t/p/w500/ckQzKpQJO4ZQDCN5evdpKcfm7Ys.jpg","description":"The wildly funny and touching story of a lonely Hawaiian girl and the fugitive alien who helps to mend her broken family.","releaseInfo":"2025","imdbRating":"7.2"},{"id":"tt22022452","type":"movie","name":"Inside Out 2","poster":"https://image.tmdb.org/t/p/w500/vpnVM9B6NMmQpWeZvzLvDESb2QY.jpg","description":"Teenager Riley's mind headquarters is undergoing a sudden demolition to make room for something entirely unexpected: new Emotions! Joy, Sadness, Anger, Fear and Disgust, who’ve long been running a successful operation by all accounts, aren’t sure how to feel when Anxiety shows up. And it looks like she’s not alone.","releaseInfo":"2024","imdbRating":"7.5"},{"id":"tt34956443","type":"movie","name":"Ne Zha 2","poster":"https://image.tmdb.org/t/p/w500/cb5NyNrqiCNNoDkA8FfxHAtypdG.jpg","description":"After a catastrophic event leaves their bodies destroyed, Ne Zha and Ao Bing are granted a fragile second chance at life. As tensions rise between the dragon clans and celestial forces, the two must undergo a series of perilous trials that will test their bond, challenge their identities, and decide the fate of both mortals and immortals.","releaseInfo":"2025","imdbRating":"8.0"},{"id":"tt30017619","type":"movie","name":"The Bad Guys 2","poster":"https://image.tmdb.org/t/p/w500/c1msaKf1wyuKcmLjjJd6rIBPFcd.jpg","description":"The now-reformed Bad Guys are trying (very, very hard) to be good, but instead find themselves hijacked into a high-stakes, globe-trotting heist, masterminded by a new team of criminals they never saw coming: The Bad Girls.","releaseInfo":"2025","imdbRating":"7.8"},{"id":"tt22898462","type":"movie","name":"The Conjuring: Last Rites","poster":"https://image.tmdb.org/t/p/w500/7JzOmJ1fIU43I3gLHYsY8UzNzjG.jpg","description":"Paranormal investigators Ed and Lorraine Warren take on one last terrifying case involving mysterious entities they must confront.","releaseInfo":"2025","imdbRating":"7.0"},{"id":"tt31036941","type":"movie","name":"Jurassic World Rebirth","poster":"https://image.tmdb.org/t/p/w500/1RICxzeoNCAO5NpcRMIgg1XT6fm.jpg","description":"Five years after the events of Jurassic World Dominion, covert operations expert Zora Bennett is contracted to lead a skilled team on a top-secret mission to secure genetic material from the world's three most massive dinosaurs. When Zora's operation intersects with a civilian family whose boating expedition was capsized, they all find themselves stranded on an island where they come face-to-face with a sinister, shocking discovery that's been hidden from the world for decades.","releaseInfo":"2025","imdbRating":"6.4"},{"id":"tt32820897","type":"movie","name":"Demon Slayer: Kimetsu no Yaiba Infinity Castle","poster":"https://image.tmdb.org/t/p/w500/fWVSwgjpT2D78VUh6X8UBd2rorW.jpg","description":"The Demon Slayer Corps are drawn into the Infinity Castle, where Tanjiro, Nezuko, and the Hashira face terrifying Upper Rank demons in a desperate fight as the final battle against Muzan Kibutsuji begins.","releaseInfo":"2025","imdbRating":"7.6"},{"id":"tt28996126","type":"movie","name":"Nobody 2","poster":"https://image.tmdb.org/t/p/w500/xGLoqM9peusKQeuwlSw2Qlhx740.jpg","description":"Former assassin Hutch Mansell takes his family on a nostalgic vacation to a small-town theme park, only to be pulled back into violence when they clash with a corrupt operator, a crooked sheriff, and a ruthless crime boss.","releaseInfo":"2025","imdbRating":"7.1"}]}