{"metas":[{"id":"tt1311031","type":"movie","name":"Demon Slayer: Kimetsu no Yaiba Infinity Castle","poster":"https://image.tmdb.org/t/p/w500/fWVSwgjpT2D78VUh6X8UBd2rorW.jpg","description":"The Demon Slayer Corps are drawn into the Infinity Castle, where Tanjiro, Nezuko, and the Hashira face terrifying Upper Rank demons in a desperate fight as the final battle against Muzan Kibutsuji begins."},{"id":"tt1218925","type":"movie","name":"Chainsaw Man - The Movie: Reze Arc","poster":"https://image.tmdb.org/t/p/w500/xdzLBZjCVSEsic7m7nJc4jNJZVW.jpg","description":"In a brutal war between devils, hunters, and secret enemies, a mysterious girl named Reze has stepped into Denji's world, and he faces his deadliest battle yet, fueled by love in a world where survival knows no rules."},{"id":"tt1156594","type":"movie","name":"Our Fault","poster":"https://image.tmdb.org/t/p/w500/yzqHt4m1SeY9FbPrfZ0C2Hi9x1s.jpg","description":"Jenna and Lion's wedding brings about the long-awaited reunion between Noah and Nick after their breakup. Nick's inability to forgive Noah stands as an insurmountable barrier. He, heir to his grandfather's businesses, and she, starting her professional life, resist fueling a flame that's still alive. But now that their paths have crossed again, will love be stronger than resentment?"},{"id":"tt1175942","type":"movie","name":"The Bad Guys 2","poster":"https://image.tmdb.org/t/p/w500/c1msaKf1wyuKcmLjjJd6rIBPFcd.jpg","description":"The now-reformed Bad Guys are trying (very, very hard) to be good, but instead find themselves hijacked into a high-stakes, globe-trotting heist, masterminded by a new team of criminals they never saw coming: The Bad Girls."},{"id":"tt980477","type":"movie","name":"Ne Zha 2","poster":"https://image.tmdb.org/t/p/w500/cb5NyNrqiCNNoDkA8FfxHAtypdG.jpg","description":"After a catastrophic event leaves their bodies destroyed, Ne Zha and Ao Bing are granted a fragile second chance at life. As tensions rise between the dragon clans and celestial forces, the two must undergo a series of perilous trials that will test their bond, challenge their identities, and decide the fate of both mortals and immortals."},{"id":"tt1376434","type":"movie","name":"Predator: Killer of Killers","poster":"https://image.tmdb.org/t/p/w500/2XDQa6EmFHSA37j1t0w88vpWqj9.jpg","description":"While three of the fiercest warriors in human history—a Viking raider, a ninja in feudal Japan, and a WWII pilot—are killers in their own right, they are merely prey for their new opponent: the ultimate killer of killers."},{"id":"tt701387","type":"movie","name":"Bugonia","poster":"https://image.tmdb.org/t/p/w500/oxgsAQDAAxA92mFGYCZllgWkH9J.jpg","description":"Two conspiracy obsessed young men kidnap the high-powered CEO of a major company, convinced that she is an alien intent on destroying planet Earth."},{"id":"tt615453","type":"movie","name":"Ne Zha","poster":"https://image.tmdb.org/t/p/w500/phM9bb6s9c60LA8qwsdk7U1N2cS.jpg","description":"A young boy is born as the reincarnation of a demonic power, into a society that hates and fears him. Destined by prophecy to bring destruction to the world, Nezha must choose between good and evil to see if he can change his fate."},{"id":"tt1232449","type":"movie","name":"Young Hearts","poster":"https://image.tmdb.org/t/p/w500/iGCtYxfuvXfy0BD5m6p7vKuPOxS.jpg","description":"14-year-old Elias increasingly feels like an outsider in his village. When he meets his new neighbour of the same age, Alexander, Elias is confronted with his burgeoning sexuality."},{"id":"tt987400","type":"movie","name":"Aztec Batman: Clash of Empires","poster":"https://image.tmdb.org/t/p/w500/s0Mlo5w4INp3bUdsJo3RaSSMXWz.jpg","description":"In the time of the Aztec empire, tragedy strikes Yohualli Coatl when his father is murdered by Spanish conquistadors. To warn King Moctezuma and his high priest, Yoka, of imminent danger, Yohualli escapes to Tenochtitlán. There, he trains in the temple of the bat god Tzinacan with his mentor, developing equipment and weaponry to confront the Spanish invasion and avenge his father’s death. Along the way, he encounters key figures like the fierce Jaguar Woman and the conquistador Hernán Cortés."},{"id":"tt1356039","type":"movie","name":"Counterattack","poster":"https://image.tmdb.org/t/p/w500/38I76hGcFY6xB47pjm7pZwkfuAF.jpg","description":"When a hostage rescue mission creates a new enemy, Capt. Guerrero and his elite soldiers must face an ambush by a criminal group."},{"id":"tt484133","type":"movie","name":"Nude","poster":"https://image.tmdb.org/t/p/w500/699DbQ8eTecLmzjTLrao9D5bbpq.jpg","description":"NUDE explores perceptions of nudity in art by chronicling the creative process of photographer David Bellemere as he's commissioned by NU Muses founder Steve Shaw to shoot a fine art calendar of nude photographs."},{"id":"tt1426776","type":"movie","name":"STRAW","poster":"https://image.tmdb.org/t/p/w500/t3cmnXYtxJb9vVL1ThvT2CWSe1n.jpg","description":"What will be her last straw? A devastatingly bad day pushes a hardworking single mother to the breaking point — and into a shocking act of desperation."},{"id":"tt870360","type":"movie","name":"The Day the Earth Blew Up: A Looney Tunes Movie","poster":"https://image.tmdb.org/t/p/w500/s2lB1kaYCdGSnZX5meQCiOR6HfX.jpg","description":"Porky and Daffy, the classic animated odd couple, turn into unlikely heroes when their antics at the local bubble gum factory uncover a secret alien mind control plot. Against all odds, the two are determined to save their town (and the world!)...that is if they don't drive each other crazy in the process."},{"id":"tt698508","type":"movie","name":"Redeeming Love","poster":"https://image.tmdb.org/t/p/w500/pDc2HxQtC0MlKD4QfRvmKREEyhc.jpg","description":"A retelling of the biblical book of Hosea set against the backdrop of the California Gold Rush of 1850."},{"id":"tt672322","type":"movie","name":"Rurouni Kenshin: The Beginning","poster":"https://image.tmdb.org/t/p/w500/rODS466qSdrwMlGdbUwPENhDN2c.jpg","description":"Before he was a protector, Kenshin was a fearsome assassin known as Battosai. But when he meets gentle Tomoe Yukishiro, a beautiful young woman who carries a huge burden in her heart, his life will change forever."},{"id":"tt1277988","type":"movie","name":"Caramelo","poster":"https://image.tmdb.org/t/p/w500/c4ZEAah5a01cu27w7vT2IAoFogk.jpg","description":"After a life-changing diagnosis, a promising chef finds hope and humor with the help of a fur-midable dog friend."},{"id":"tt581791","type":"movie","name":"The Blonde One","poster":"https://image.tmdb.org/t/p/w500/v5tlBUkLz3s3cjSj9CrzOd7LZ7d.jpg","description":"Gabriel rents a room in Juan’s House. They work together in a Woodwork place. Gabriel is a very quiet guy and has a little daughter. Juan is a party boy who has a lots of girls around. Inadvertently the sexual tension starts to grow between them. It opens a new hidden forbidden world they have to deal with."},{"id":"tt774370","type":"movie","name":"Dog Man","poster":"https://image.tmdb.org/t/p/w500/89wNiexZdvLQ41OQWIsQy4O6jAQ.jpg","description":"When a faithful police dog and his human police officer owner are injured together on the job, a harebrained but life-saving surgery fuses the two of them together and Dog Man is born. Dog Man is sworn to protect and serve—and fetch, sit and roll over. As Dog Man embraces his new identity and strives to impress his Chief, he must stop the pretty evil plots of feline supervillain Petey the Cat."},{"id":"tt483455","type":"movie","name":"Bungo Stray Dogs: Dead Apple","poster":"https://image.tmdb.org/t/p/w500/7ueB7Kxq2GObp5aDw6rsdzVefzP.jpg","description":"A large scale catastrophe is occurring across the planet. Ability users are discovered after the appearance of a mysterious fog, apparently having committed suicide, so the Armed Detective Agency sets out to investigate these mysterious deaths. The case seems to involve an unknown ability user referred to as \"Collector,\" a man who could be the mastermind behind the incident.\r Trust and courage are put to the test in order to save the city of Yokohama and ability users across the world from the grip of Collector where the Armed Detective Agency forms an unlikely partnership with the dangerous Port Mafia."}]}